#pragma once

#include <QVector>

// добработать: создать аналогичный вектор, только с char, по типу переменных,
// чтобы знать как преобразовывать на входе

class ParsysX
{
public:
    ParsysX();
    int sizeOf(const int&) const;
private:
    const QVector<int> params_sizes {
        4, // Вес на крюке  // кг  // f // 0 // 1
        4, // Нагрузка на долото  // кг reerr  // f // 1 // 1
        4, // Давление на входе  // ppm c  // f // 2 // 1
        4, // Давление на выходе  // ppm c  // f // 3 // 1
        4, // Обороты ротора  // об/с  // f // 4 // 1
        4, // Момент на роторе  // Н*м  // f // 5 // 1
        4, // Плотность на входе  // кг/м3 m  // f // 6 // 1
        4, // Плотность на выходе  // кг/м3 m  // f // 7 // 1
        4, // Температура на входе  // грС  // f // 8 // 1
        4, // Температура на выход  // грС  // f // 9 // 1
        4, // Объем рабочих емк. й  // м3 m  // f // 10 // 1
        4, // Общий газ Ё   o  // ppm  // f // 11 // 1
        4, // Положение крюка  // м it  // f // 12 // 1
        4, // Ходов насоса 1  // х/сек к n  // f // 13 // 1
        4, // Ходов насоса 2  // х/сек к n  // f // 14 // 1
        4, // Расход на выходе де  // м3/сек c  // f // 15 // 1
        4, // С1 e  // ppm  // f // 16 // 1
        4, // С2 sdfsdfsdf  // ppm  // f // 17 // 1
        4, // С3 e  // ppm  // f // 18 // 1
        4, // H2  // ppm  // f // 19 // 1
        4, // С4  // ppm fs  // f // 20 // 1
        4, // С5  // ppm  // f // 21 // 1
        4, // Мех.скорость скорост  // м/сек  // f // 22 // 1
        4, // ДМК 2 Ё   o  // сек/м  // f // 23 // 1
        4, // Интервал за рейс  // м it  // f // 24 // 1
        4, // Время бурения рейс  // сек  // f // 25 // 1
        4, // Стоимость бурения  // $/m  // f // 26 // 1
        4, // DEXP  // /Pa  // f // 27 // 1
        4, // DEXC с учетом плотн.  // a  // f // 28 // 1
        4, // DEXCN износа долота  // /Pa  // f // 29 // 1
        4, // Эквив.плотн.циркуляц  // кг/м3 m  // f // 30 // 1
        4, // Расход на входе де  // м3/сек c  // f // 31 // 1
        4, // Расход разность ть  // м3/сек c  // f // 32 // 1
        4, // Плотность разность ь  // кг/м3 m  // f // 33 // 1
        4, // Температура разность  // грС  // f // 34 // 1
        4, // Ходов насоса рейс  // ход  // l // 35 // 1
        4, // Оборотов долота рейс  // об t  // l // 36 // 1
        4, // Отставание газов(хн)  // ход  // f // 37 // 1
        4, // Отставание газов(вр)  // сек  // f // 38 // 1
        4, // Глуб.отст.газов усте  // м it  // f // 39 // 1
        4, // Отставание шлама(вр)  // сек  // f // 40 // 1
        4, // С2...С6 / С1...С6  // nit  // f // 41 // 1
        4, // С1...С2 / С3...С6  // nit  // f // 42 // 1
        4, // С4...С6 / С3  // // f // 43 // 1
        4, // Объем емкости 1  // м3 m  // f // 44 // 1
        4, // Объем емкости 2  // м3 m  // f // 45 // 1
        4, // Объем емкости 3    // м3 m  // f // 46 // 1
        4, // Объем емкости 4  o  // м3 m  // f // 47 // 1
        4, // Объем емкости 5  // м3  // f // 48 // 1
        4, // Объем емк.Долива  // м3  // f // 49 // 1
        4, // Давл.в зоне дол.СПО  // Па  // f // 50 // 1
        4, // Объем всех емкостей  // м3  // f // 51 // 1
        4, // Время сбора данных  // сек  // l // 52 // 1
        4, // Глубина Забоя ектир.  // м  // f // 53 // 1
        4, // Глубина долота  // м c  // f // 54 // 1
        4, // Глубина вертикальная  // м  // f // 55 // 1
        4, // Отставание шлама(хн)  // ход  // f // 56 // 1
        4, // Объем затрубья о пр.  // м3 m  // f // 57 // 1
        4, // Пот.давл. затрубья  // ppm  // f // 58 // 1
        4, // Объем в трубах енте  // м3 m  // f // 59 // 1
        4, // Пот.давл. в трубах х  // ppm  // f // 60 // 1
        4, // Скорость в насадках  // м/сек  // f // 61 // 1
        4, // Пот.давл. в насадках  // ppm  // f // 62 // 1
        4, // Гидр.мощн. на долоте  // Вт  // f // 63 // 1
        4, // Гидр.мощн. на площaд  // Вт/м2 ¤  // f // 64 // 1
        4, // Удар.нагр. на долото  // Н  // f // 65 // 1
        4, // Удар.нагр. на площад  // Па 2 m ¤  // f // 66 // 1
        4, // Гидр.мощность систем  // Вт  // f // 67 // 1
        4, // Скорость оседания шл  // м/сек  // f // 68 // 1
        4, // Пот.давл. в оборуд.  // ppm  // f // 69 // 1
        4, // Пот.давл. суммарные  // ppm  // f // 70 // 1
        4, // Град.давл.поров:Dexp  // кг/м3  // f // 71 // 1
        4, // Над забоем  забоем  // м m  // f // 72 // 1
        2, // Номер рейса  // // i // 73 // 1
        4, // Глубина начала рейса  // м  // f // 74 // 1
        4, // Время начала рейса  // сек m/yy  // l // 75 // 1
        4, // Глубина подошвы Об.К  // м :mm:ss  // f // 76 // 1
        4, // Баланс дол/выт СПО  // м3 ек  // f // 77 // 1
        2, // Способ бурения  // // i // 78 // 1
        4, // Расход турбины /сек  // об/м3  // f // 79 // 1
        4, // Плотность шлама ма  // кг/м3 m  // f // 80 // 1
        4, // Диаметр шлама ма  // м ch  // f // 81 // 1
        4, // Вязкость раствора  // Па*сек м  // f // 82 // 1
        4, // Напряжение сдвига га  // Па м2 m  // f // 83 // 1
        4, // Град.пластового давл  // кг/м3 m  // f // 84 // 1
        4, // Град.горного давлен.  // кг/м3 m  // f // 85 // 1
        12, // Тип долота ensity  // /cc  // c // 86 // 1
        4, // Стоимость долота  // $ cc  // f // 87 // 1
        4, // Диаметр долота ty  // м ch  // f // 88 // 1
        4, // Sigma:Напряжение ГП  // 3/ход r  // f // 89 // 1
        4, // Sigma:Прочность ГП 3  // 3/ход  // f // 90 // 1
        4, // Sigma:Эталонная проч  // // f // 91 // 1
        4, // Sigma:Пористость ГП  // % /м  // f // 92 // 1
        4, // Площадь насадок y  // м2 m  // f // 93 // 1
        4, // Производит. насоса 1  // м3/ход r  // f // 94 // 1
        4, // Объем емкости 9  // м3 ек  // f // 95 // 1
        4, // ГК (гамма-каротаж) д  // API  // f // 96 // 1
        4, // Изменение Давл.на вх  // ppm  // f // 97 // 1
        4, // Гидростатическое дав  // ppm  // f // 98 // 1
        4, // Эффективное давление  // ppm  // f // 99 // 1
        4, // Глубина выхода шлама  // м  // f // 100 // 1
        4, // Глубина забоя датчик  // м c  // f // 101 // 1
        4, // Момент на долоте  // Н*м  // f // 102 // 1
        2, // Код породы ode  // // i // 103 // 1
        4, // Время СПО рейс  // сек  // f // 104 // 1
        4, // Sigm:Град.давл.пласт  // кг/м3  // f // 105 // 1
        4, // Время на свечу  // сек св nd  // f // 106 // 1
        2, // Свеч вне скважины  // шт ч  // i // 107 // 1
        2, // Свеч внутри скважины  // шт ч  // i // 108 // 1
        2, // Труб вне скважины  // шт б  // i // 109 // 1
        2, // Труб внутри скважины  // шт б  // i // 110 // 1
        2, // Труб в одной свече  // шт б  // i // 111 // 1
        2, // Состояние клиньев  // ipe  // i // 112 // 1
        2, // Труб до забоя трубы  // шт б  // i // 113 // 1
        4, // H2S датчик 1 рубы  // ppm  // f // 114 // 1
        4, // Вес крюке СПО средн.  // кг  // f // 115 // 1
        4, // Вес крюке СПО ожид.  // кг  // f // 116 // 1
        4, // Водоизм. ожидаемое t  // м3 m m  // f // 117 // 1
        4, // Водоизм. расчетное t  // м3 m m  // f // 118 // 1
        4, // Водоизм. текущее ent  // м3 m m  // f // 119 // 1
        4, // Давл.свабир/поршнев.  // ppm  // f // 120 // 1
        4, // Потери БР по времени  // м3 10мин н  // f // 121 // 1
        4, // Потери БР по глубине  // м3 м m  // f // 122 // 1
        4, // Время СПО ка инструм  // сек  // f // 123 // 1
        4, // Давление пульсаций  // ppm  // f // 124 // 1
        32, // Шламограмма re  // si  // c // 125 // 1
        9, // Нефтепроявления  // // c // 126 // 1
        4, // Дифференциальное дав  // ppm  // f // 127 // 1
        4, // Плотность перелома  // кг/м3 m  // f // 128 // 1
        4, // Время спуска Обс.Тр.  // сек об.тр  // f // 129 // 1
        4, // Время спуска Обс.Кол  // сек jt  // f // 130 // 1
        2, // Обс.Труб внутри скв.  // шт тр  // i // 131 // 1
        2, // Обс.Труб вне скваж.  // шт тр  // i // 132 // 1
        4, // Время спускаОбК рейс  // сек  // f // 133 // 1
        4, // Наработка тал.каната  // кг*м  // f // 134 // 1
        4, // Ходов насоса 3  // х/сек к  // f // 135 // 1
        4, // Потери БР суммарные  // м3 час ur  // f // 136 // 1
        4, // нС4 / С1...С6 0 м)  // % 10м m  // f // 137 // 1
        4, // Объем труб (маталла)  // м3 м m  // f // 138 // 1
        4, // Время контр.поглощ.  // сек  // f // 139 // 1
        4, // Глуб.спускаемой ОбК  // м c  // f // 140 // 1
        4, // Время контр.выброса  // сек  // f // 141 // 1
        4, // Кол-во закаченого БР  // м3 m  // f // 142 // 1
        4, // Мгновенная скор.прох  // м/сек  // f // 143 // 1
        4, // Время к.выброса рейс  // сек  // f // 144 // 1
        4, // Объем емкости 10 иам  // м3  // f // 145 // 1
        4, // Объем емкости 11 иам  // м3 e  // f // 146 // 1
        4, // Время к.поглощения р  // сек  // f // 147 // 1
        31, // Примечание res.Loss  // si  // c // 148 // 1
        4, // Объем емкости 12  // м3 м  // f // 149 // 1
        2, // Обсадных труб забой  // шт тр 9  // i // 150 // 1
        4, // Время ремонта рейс  // сек  // f // 151 // 1
        4, // Сумма С1...С6  // ppm  // f // 152 // 1
        4, // С1...С2 / С5...С6  // // f // 153 // 1
        4, // H2S  // ppm  // f // 154 // 1
        4, // Минерализация на вх  // // f // 155 // 1
        4, // Минерализация на вых  // // f // 156 // 1
        4, // Время бурения час  // сек  // f // 157 // 1
        4, // Время циркуляции рей  // сек  // f // 158 // 1
        4, // Время проработки  // сек  // f // 159 // 1
        4, // Время промывки рейс  // сек  // f // 160 // 1
        4, // Время наращивание ре  // сек  // f // 161 // 1
        4, // Время СПО рейс  // сек  // f // 162 // 1
        4, // Время ПЗР рейс  // сек  // f // 163 // 1
        4, // Время ГИС рейс  // сек  // f // 164 // 1
        4, // Время простоя рейс  // сек  // f // 165 // 1
        4, // Плотность емк 1  // кг/м3  // f // 166 // 1
        4, // Плотность емк 2  // кг/м3  // f // 167 // 1
        4, // Плотность емк 3 ю  // кг/м3  // f // 168 // 1
        4, // Плотность емк 4 аван  // кг/м3 m  // f // 169 // 1
        4, // Плотность емк 5  // кг/м3  // f // 170 // 1
        4, // Температура емк 1 с  // грС м  // f // 171 // 1
        4, // Температура емк 2 а  // грС к  // f // 172 // 1
        4, // Температура емк 3 да  // грС ATA\  // f // 173 // 1
        4, // Температура емк 4 н.  // грС  // f // 174 // 1
        4, // Температура емк 5  // грС  // f // 175 // 1
        4, // Кальцит  // ppm  // f // 176 // 1
        4, // С2' Этилен ора Емк6  // ppm  // f // 177 // 1
        4, // Прогноз износа Долот  // м  // f // 178 // 1
        4, // H2S датчик 2 носа Д.  // ppm  // f // 179 // 1
        4, // Dexp:Полный град.дав  // кг/м3  // f // 180 // 1
        4, // Sigm:Полный град.дав  // кг/м3  // f // 181 // 1
        4, // Время проработки с  // сек  // f // 182 // 1
        4, // Время промывки ейс  // сек  // f // 183 // 1
        4, // Время наращивания  // сек  // f // 184 // 1
        4, // Время СПО  рейс  // сек  // f // 185 // 1
        4, // Время циркуляции с u  // сек  // f // 186 // 1
        4, // Время простоя рейс  // сек  // f // 187 // 1
        4, // Объемная плотн.шлама  // кг/м3  // f // 188 // 1
        4, // Ускор.Обор.Ротора  // об/с2  // f // 189 // 1
        2, // Направление крюка on  // // i // 190 // 1
        4, // Абсол.скорость крюка  // м/сек  // f // 191 // 1
        4, // Глубина инклинометра  // м  // f // 192 // 1
        4, // Отклонитель  // рад  // f // 193 // 1
        4, // Азимут  // рад  // f // 194 // 1
        4, // Зенит  // рад  // f // 195 // 1
        4, // Доломит  // % m  // f // 196 // 1
        4, // Момент на ключе ----  // Н*м  // f // 197 // 1
        4, // Глуб.отст.газов хром  // м gC  // f // 198 // 1
        4, // Плотность Долива  // кг/м3  // f // 199 // 1
        4, // Температура Долива  // грС  // f // 200 // 1
        4, // нС4 о 9  // ppm  // f // 201 // 1
        4, // С1 / С1...С6  // %  // f // 202 // 1
        4, // С2 / С1...С6  // %  // f // 203 // 1
        4, // С3 / С1...С6  // %  // f // 204 // 1
        4, // Минерал.плотн.шлама  // кг/м3  // f // 205 // 1
        4, // С4 / С1...С6  // %  // f // 206 // 1
        4, // С5 / С1...С6  // %  // f // 207 // 1
        4, // С6 / С1...С6  // %  // f // 208 // 1
        4, // С6 e  // ppm  // f // 209 // 1
        4, // Ускорение инструмент  // м/сек2  // f // 210 // 1
        4, // Скорость проработки  // м/сек  // f // 211 // 1
        2, // Технологический этап  // ode  // i // 212 // 1
        4, // Этапы ГТИ по времени  // // l // 213 // 1
        4, // Этапы ГТИ по глубине  // // l // 214 // 1
        4, // иС4 .Давление циркул  // ppm  // f // 215 // 1
        4, // С1 по шламу  // ppm  // f // 216 // 1
        4, // С2 по шламу  // ppm  // f // 217 // 1
        4, // С3 по шламу  // ppm  // f // 218 // 1
        4, // С4 по шламу  // ppm  // f // 219 // 1
        4, // С5 по шламу  // ppm  // f // 220 // 1
        4, // С6 по шламу  // ppm  // f // 221 // 1
        4, // Сумма шламу С1...С6  // ppm  // f // 222 // 1
        4, // иС4/С1...С6  // %  // f // 223 // 1
        4, // С2...С3 / С4...С6  // // f // 224 // 1
        4, // С1 / С2...С6  // // f // 225 // 1
        4, // CO2  // ppm  // f // 226 // 1
        4, // Перепад давл на турб  // атм  // f // 227 // 1
        4, // Давление над забоем  // ppm  // f // 228 // 1
        4, // Хроматограф время .  // сек  // f // 229 // 1
        4, // Хроматограф канал 1  // код  // f // 230 // 1
        4, // Хроматограф канал 2  // код  // f // 231 // 1
        10, // Порядок пород шлама  // // c // 232 // 1
        4, // Код аварии  // // l // 233 // 1
        4, // РТК ДЫ  Л G У G М<Д L // // l // 234 // 1
        4, // Скорость инструмента  // м/сек  // f // 235 // 1
        4, // Объем емкости 6  // м3  // f // 236 // 1
        4, // Объем емкости 7  // м3  // f // 237 // 1
        4, // Объем емкости 8  // м3  // f // 238 // 1
        4, // Объем нераб.емкостей  // м3  // f // 239 // 1
        4, // Dexp:Пластовое давл.  // ppm  // f // 240 // 1
        4, // Sigm:Пластовое давл.  // ppm  // f // 241 // 1
        4, // Вес на крюке СПО min  // кг  // f // 242 // 1
        4, // Вес на крюке СПО max  // кг  // f // 243 // 1
        4, // Обороты долота  // об/с  // f // 244 // 1
        4, // Коэф.откр.пористости  // % м  // f // 245 // 1
        4, // Вес бурового инстр.  // кг  // f // 246 // 1
        4, // Dexp:линия норм.упл.  // кг/м3  // f // 247 // 1
        4, // Sigm:линия норм.упл.  // кг/м3  // f // 248 // 1
        4, // иС5  // ppm  // f // 249 // 1
        4, // иС5 / С1...С6  // %  // f // 250 // 1
        4, // нС5  // ppm  // f // 251 // 1
        4, // нС5 / С1...С6  // %  // f // 252 // 1
        4, // Момент ротора (max)  // Н*м  // f // 253 // 1
        20, // Заводской ном.долота  // г/м3  // c // 254 // 1
    };
};
